{"data":{"site":{"siteMetadata":{"title":"Gatsby MDX Starter Project","description":"My Gatsby MDX Starter Project","author":"Robin Wieruch","keywords":["Software Engineer","Web Developer"]}},"mdx":{"frontmatter":{"title":"The Road to GraphQL","date":"July 18, 2018","banner":{"childImageSharp":{"sizes":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAOABQDASIAAhEBAxEB/8QAFwABAQEBAAAAAAAAAAAAAAAAAwAEBf/EABYBAQEBAAAAAAAAAAAAAAAAAAEAAv/aAAwDAQACEAMQAAABUNZz0IJ1/8QAGRAAAwEBAQAAAAAAAAAAAAAAAgMEARIh/9oACAEBAAEFAqKWLcNbi1buhdKTWhIQarPP/8QAGBEBAAMBAAAAAAAAAAAAAAAAAQACITH/2gAIAQMBAT8Br3ZYBn//xAAVEQEBAAAAAAAAAAAAAAAAAAAAAf/aAAgBAgEBPwGK/8QAGxAAAgIDAQAAAAAAAAAAAAAAAAECERIxcZH/2gAIAQEABj8CcY1XDcfDQ55JF5Jj6f/EABkQAAMBAQEAAAAAAAAAAAAAAAABESExYf/aAAgBAQABPyF00p3wQkBDb0sYsSTmNDW+KSESf//aAAwDAQACAAMAAAAQnM//xAAWEQEBAQAAAAAAAAAAAAAAAAABADH/2gAIAQMBAT8QAkxMQv/EABcRAQEBAQAAAAAAAAAAAAAAAAEAITH/2gAIAQIBAT8Q62AN/8QAHRABAQACAgMBAAAAAAAAAAAAAREAIUHBMVFh4f/aAAgBAQABPxASbSKOw+/uNDMWv7ywnmDQsKmaa4kMgHWGilCmuescZAub4hn/2Q==","aspectRatio":1.383529411764706,"src":"/static/banner-c8e890d78c744d3b10f65b5f3206c100-67eb0.jpg","srcSet":"/static/banner-c8e890d78c744d3b10f65b5f3206c100-23aaa.jpg 225w,\n/static/banner-c8e890d78c744d3b10f65b5f3206c100-5f596.jpg 450w,\n/static/banner-c8e890d78c744d3b10f65b5f3206c100-67eb0.jpg 588w","sizes":"(max-width: 588px) 100vw, 588px"}}},"slug":"/graphql-book","categories":["graphql"],"keywords":["graphql","book"]},"code":{"body":"function _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\n\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n\nreturn ((_ref) => {\n  let {\n    components\n  } = _ref,\n      props = _objectWithoutProperties(_ref, [\"components\"]);\n\n  return React.createElement(MDXTag, {\n    name: \"wrapper\",\n    components: components\n  }, React.createElement(MDXTag, {\n    name: \"p\",\n    components: components\n  }, `The central theme of this book is GraphQL in modern applications. While GraphQL is only a specification that can be used in many programming languages, this book focuses on GraphQL in JavaScript. Facebook--the company behind the GraphQL--didn't release GraphQL's reference implementation in JavaScript, but it remains one of the more compelling languages for mordern client-server architecture. Using Facebook's specification as their blueprint, other programming languages like Python and Java followed.`), React.createElement(Link, {\n    to: \"https://roadtoreact.com/\"\n  }, \"Find out more about it\"), React.createElement(MDXTag, {\n    name: \"p\",\n    components: components\n  }, `GraphQL a query language that can be used anywhere, but it often bridges the gap between client and server applications. It isn't opionated about which network layer is used, so data can be read and written between client and server applications. It is used to complement the network stack for many libraries and frameworks in JavaScript. The client side takes advancategorye of popular solutions like React, Angular, and Vue, while the server side can use middleware libraries like Express, Koa, and Hapi in a Node.js environment. It is just a matter of sending GraphQL operations with plain HTTP across the wire.`), React.createElement(MDXTag, {\n    name: \"p\",\n    components: components\n  }, `The emergence of GraphQL introduces a new era in web development. RESTful applications were the industry favorite for data transfers between client and server applications, but modern requirements have shifted. Applications have to deal with multiple clients--i.e. desktop, web, mobile, wearables--which are all interested in APIs exposed by server applications. The choice becomes one between using multiple client-specific APIs with REST, or just one API with GraphQL for all client applications, which hardly seems like a choice at all. GraphQL is more than just a unified interface, though; its ecosystem offers powerful capbilities and even more potential as its open source community grows.`), React.createElement(MDXTag, {\n    name: \"p\",\n    components: components\n  }, `For me, it was a lucky coincidence that a former coworker open-sourced the GraphQL implementation for Java. He worked to become one of GraphQL's first open source contributors, eventually creating one of the go-to implementations for Java. The experience shaped my own thinking about GraphQL, which was expanded when my employer evaluated GraphQL for their enterprise application. The glue between our client and server application was largely influenced by REST, but we had API endpoints for all our RESTful resources in place, eventually running into issues like Facebook for API-consuming client-dide applications. The API endpoints were too rigid, so they required aggregations and modifications. An aggregation means putting resources a singular API endpoint, where a modification is to offer variations of an API endpoint to request different representations of a resource. We introduced our own implementation to request resources from the server, and avoided modifying endpoints. But the aggregations were still in place, so we had our own naive implementation of GraphQL, though it was only able to query one resource and didn't understand relationships. From a client-side perspective, only Relay for React was as sophisticated a library in terms of consuming GraphQL APIs, so we invested time in this as well. In the end, GraphQL was too early in its development, so we postponed introducing it to our technology stack. Admittedly, none of us knew it would become so powerful or so popular.`), React.createElement(MDXTag, {\n    name: \"p\",\n    components: components\n  }, `This book starts with GraphQL in client-side applications, so you will use React as a UI library to consume your first third-party GraphQL API, which happens to be GitHub's GraphQL API. It is a popular choice among developers for a couple reasons: GitHub was one of few popular companies to releas a GraphQL API to the public; GitHub's subsequent growth has granted some credibility to GraphQL itself; and a third-party API usually focuses on client-side GraphQL in the beginning. This book teaches how to consume the GraphQL API into a client application without exposing it to the server.`), React.createElement(MDXTag, {\n    name: \"p\",\n    components: components\n  }, `When we shift gears toward GraphQL on the server side, we will implement a GraphQL API that can eventually be consumed into client-side operations. By the end, you should have a firm grasp about using GraphQL in almost all JavaScript applications. I say 'almost' because there are always new libraries, patterns, and best practices that need to be learned to keep up with emerging technology.`), React.createElement(MDXTag, {\n    name: \"p\",\n    components: components\n  }, `I sincerely hope this book provides an optimal learning experience for GraphQL. While you might not use React or Express daily, you should be able to apply these teachings in other solutions like Angular, Vue, Koa, or Hapi.`));\n});"}}},"pageContext":{"id":"30965744-3d3b-51f7-a685-e3dafc3ac8e3","prev":{"id":"14d6af7d-2a76-58b5-b545-bea8ccaf30b0","excerpt":"The Road to learn React teaches the fundamentals of React. You will build a real-world application in plain React without complicated tooling. Everything from project setup to deployment on a server will be explained for you. The book comes with…","fields":{"title":"The Road to learn React","slug":"/react-book","categories":["react"]},"code":{"scope":"/Users/mydspr/Developer/Repos/gatsby-mdx-starter-project/.cache/gatsby-mdx/remote-mdx-dir/251638d8becf899925f49b238a86232d.js"}},"next":null}}